In [1]:
import pandas as pd
import numpy as np
pd.__version__

'2.3.0'

In [7]:
dataset = pd.DataFrame(np.array([[1,2,3,4], 
                                [5,6, None,8]]))

dataset.columns = np.array(["a", "b", "c", "d"])
print(dataset, dataset.shape)
dataset.isna()

   a  b     c  d
0  1  2     3  4
1  5  6  None  8 (2, 4)

       a      b      c      d
0  False  False  False  False
1  False  False   True  False

In [8]:
s1 = pd.Series(list("Soham"))
s2 = pd.Series([15, 20, 25, 30, 2], index=s1)

print(s2, s2['o'])

scalar1 = pd.Series(11, index= s2)
print("\n", scalar1)


s3 = pd.Series(["o", "h", 20, 2, "S"])

S    15
o    20
h    25
a    30
m     2
dtype: int64 20

 15    11
20    11
25    11
30    11
2     11
dtype: int64

In [9]:
v1 = pd.Series([1,2,3,4, 6], index = s3)

v2 = pd.Series([9, 14, -5 , 20, 2], index = s1)

v3 = v1 + v2
print(v3, "\n")
print(v3.dropna())
print("\n", v3.fillna(1))
print("\n")
add = v1.add(v2, fill_value = 0)
print(add)

2      NaN
20     NaN
S     15.0
a      NaN
h     -3.0
m      NaN
o     15.0
dtype: float64

S    15.0
h    -3.0
o    15.0
dtype: float64

 2      1.0
20     1.0
S     15.0
a      1.0
h     -3.0
m      1.0
o     15.0
dtype: float64


2      4.0
20     3.0
S     15.0
a     20.0
h     -3.0
m      2.0
o     15.0
dtype: float64

In [5]:
df_movie_rating = pd.DataFrame(
    {"movie1" : [1, 2, 5, 3, 4, 1],
     "movie2" : [2, 3, 5, 1, 2, 4]},
     index = ["abc", "kia", "kai", "bob", "jeff", "car"]
    )
df_movie_rating

      movie1  movie2
abc        1       2
kia        2       3
kai        5       5
bob        3       1
jeff       4       2
car        1       4

In [6]:
def transform(movies: pd.DataFrame) -> pd.DataFrame:
    for user in movies.index:
        for col in movies.columns:
            if movies.loc[user, col].any() == 5:
                movies.loc[user] = "A"
            elif movies.loc[user] == 4:
                movies.loc[user] = "B"
            elif movies.loc[user] == 3:
                movies.loc[user] = "C"
            else:
                movies.loc[user] = "F"

    return movies


transform(df_movie_rating)

print(df_movie_rating)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
def change_rating(rating):

    if rating == 5:
        return "A"
    elif rating == 4:
        return "B"
    elif rating == 3:
        return "C"
    else:
        return "F"
    

df_movie_rating.map(change_rating)

     movie1 movie2
abc       F      F
kia       F      C
kai       A      A
bob       C      F
jeff      B      F
car       F      B

In [ ]:
df_test_scores = pd.DataFrame(
    {"test1" : [40, 96, 50, 100, 30, 10],
     "test2" : [54, 79, 80, 100, 20, 40]},
     index = ["abc", "kia", "kai", "bob", "jeff", "car"]
    )
df_test_scores

#print(df_test_scores.max())
#print(df_test_scores.min())
#print(df_test_scores.mean())
df_test_scores.describe()

            test1       test2
count    6.000000    6.000000
mean    54.333333   62.166667
std     36.340978   29.559544
min     10.000000   20.000000
25%     32.500000   43.500000
50%     45.000000   66.500000
75%     84.500000   79.750000
max    100.000000  100.000000

In [11]:
df_test_scores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, abc to car
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   test1   6 non-null      int64
 1   test2   6 non-null      int64
dtypes: int64(2)
memory usage: 144.0+ bytes

In [13]:
df_name = pd.DataFrame(
    {"first" : ["kai", "john", "bob", "jeff", "kai", "dave"],
     "last" : ["Gellard", "smith", "callum", "colgate", "lewis", "smith"]})
df_name

  first     last
0   kai  Gellard
1  john    smith
2   bob   callum
3  jeff  colgate
4   kai    lewis
5  dave    smith

In [14]:
grouped_first = df_name.groupby("first")
grouped_first.count()
group_data_first = grouped_first.get_group("kai")
group_data_first

  first     last
0   kai  Gellard
4   kai    lewis

In [15]:
grouped_last = df_name.groupby("last")
grouped_last.count()
group_data_last = grouped_last.get_group("smith")
group_data_last

  first   last
1  john  smith
5  dave  smith

# Pandas SQL Operations

In [16]:
import sqlite3

create_table = """
CREATE TABLE student_score
(ID INTEGER, NAME VARCHAR (20), Math REAL, Science REAL);
"""

In [18]:
#Executing sql query
execute_sql = sqlite3.connect(':memory:')
execute_sql.execute(create_table)
execute_sql.commit()

In [19]:
insertSQL = [(10, "Kai", 99.5, 98.9), 
             (12, "John", 44.6, 79.7),
             (6, "daisy", 98.5, 32.4),
             (11, "Dave", 56.1, 67.3),
             (2, "Maisey", 56.2, 12.3)
            ]
insert_statement = "insert into student_score values (?, ?, ?, ?)"

execute_sql.executemany(insert_statement, insertSQL)
execute_sql.commit()

In [20]:
sql_query = execute_sql.execute("SELECT * FROM student_score")

result_set = sql_query.fetchall()

result_set

[(10, 'Kai', 99.5, 98.9),
 (12, 'John', 44.6, 79.7),
 (6, 'daisy', 98.5, 32.4),
 (11, 'Dave', 56.1, 67.3),
 (2, 'Maisey', 56.2, 12.3)]

In [21]:
# Converting sql to pandas dataframe

df_student_records = pd.DataFrame(result_set, columns = ["ID", "NAME", "Math", "Science"])
df_student_records

   ID    NAME  Math  Science
0  10     Kai  99.5     98.9
1  12    John  44.6     79.7
2   6   daisy  98.5     32.4
3  11    Dave  56.1     67.3
4   2  Maisey  56.2     12.3

In [ ]:


data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

json_data = pd.DataFrame(data)
print(json_data)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300